{
    "Overview": {
        "Project name": [
            "Name: Ultra-scale AIOps",
            "Acronym/code: AIOps."
        ],
        "Stakeholder": [
            "John Miller"
        ],
        "Team": [
            "Jorge Cardoso @j00760260, Yang Haojin @ywx1029678 , Vittorio Cozzolino @v00609018, Zi Yang @84202289, Soumajit Majumder @00629282",
            "Past team members: Fan Wu @84194982, Anshul Jindal @84200308, Valentin Radu."
        ],
        "Target Phase:": [],
        "eSpace groups": [
            "Edge AI: MUC.",
            "Edge AI: HQ-MUC"
        ],
        "OneBox:": [],
        "Schedule": [
            "15.03.2023 -- 15.03.2024"
        ],
        "Deliverables": [
            "D1",
            "D2"
        ],
        "Scope": [
            "In: abc",
            "Out: abc"
        ],
        "Use cases": [
            "Assessing Service Impact From Change to reduce noise, understand and prioritize work based on service impact"
        ]
    },
    "Description": {
        "Goal": [
            "Develop a PoC which demonstrated the benefits of Edge AI w.r.t. latency, response time and bandwidth"
        ],
        "Background": [
            "In recent years, cloud computing has become a central part of the AI evolution.",
            "To better address requirements, businesses are becoming aware of the need to bring the technology closer to customers.",
            "Thus, Edge AI is emerging as a solution that uses ML to process data generated at the local level."
        ],
        "Problem": [
            "While the edge model considerably reduces transmission costs and latency requirements, it raises questions with respect to system architectures, AI pipelines and privacy and reliability concerns. An example of this technology is Amazon Alexa which learns and stores phrases locally using AI.",
            "When a user gives a verbal command, the device sends the voice recording to an edge network where it is transformed to text using AI algorithms. Without an edge network the response time would be seconds, with edge the latency is reduced to <400 ms."
        ],
        "Approach": [
            "As a starting point, this project will use two use cases involving video recognition, security cameras, OCR, real-time device tracking, as well as cloud gaming and video compression.",
            "In one use case, cameras will monitor containers in a transportation chain, while the ML will recompile data in real time for the container tracking process.",
            "The two use cases will be used to derive requirements and implement a prototype to demonstrate how edge platforms can be exploited to steer AI-driven applications."
        ],
        "Results": [
            "The prototype to be developed will serve to experiment with various architecture configurations, derive latency and bandwidth constraints, and explore how high levels of reliability and security can be achieved."
        ]
    },
    "Milestones": {
        "*M1": {
            "Name": [
                "PoC_1"
            ],
            "Date": [
                "15.03.2023"
            ],
            "Description": [
                "Integration technology with RoboArtisan service as a Skill App",
                "End-to-end demo of robot following a group of similar persons",
                "KPI dashboard with FPS, qps, etc. for Adaptive Cloud-Edge Scheduling"
            ],
            "Status": [
                "Done"
            ],
            "Deliverables": [
                "D1"
            ]
        }
    },
    "Sprints": {
        "$Jan 2023": {
            "Tasks": {
                "&Integration": [
                    "Jan Integration"
                ],
                "&Demo": [
                    "Prepare an end-to-end demo"
                ]
            },
            "17.01.2023": {
                "Status": [
                    "[&Demo, @j00760260, %75], description of the work done for the task",
                    "[&Integration, @j00760260, %75], description of the work done for the task"
                ],
                "Risks": [
                    "No risk"
                ]
            },
            "12.01.2023": {
                "Status": [
                    "[&Demo, @j00760260, %90], description of the work done for the task",
                    "[&Integration, @j00760260, %95], description of the work done for the task"
                ],
                "Risks": [
                    "Backup may fail due to energy failure"
                ]
            }
        },
        "$Feb 2023": {
            "Tasks": {
                "&Integration2": [
                    "FEb Integration"
                ],
                "&Demo2": [
                    "Prepare an end-to-end demo"
                ]
            },
            "11.01.2023": {
                "Status": [
                    "[&Demo, @j00760260, %75], description of the work done for the task",
                    "[&Integration, @j00760260, %95], description of the work done for the task+"
                ],
                "Risks": [
                    "No risks"
                ]
            }
        }
    }
}